/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_printf.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: okres <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2017/01/13 16:44:18 by okres             #+#    #+#             */
/*   Updated: 2017/01/14 17:46:49 by okres            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

int ft_printf(const char * restrict str, ...)
{
	va_list vl;
	char *ptr;

	ptr = str;
	va_start (vl, str);
	while (ptr)
	{
		if (*ptr == '%')
		{
			//запуск функции которая будет проверять наличие спецификаторов после %
		}
	}

	return (0);
}
